Repository: sigg3/ease
Catalog: locales/*/LC_MESSAGES/*.po
Languages: no

source: files stored for 90 days.
no: filer lagres i 90 dager.

source: None
no: Ingen

source: files 0-2 GB in size must queue.
no: filer mellom 0-2 GB må stå i kø.

source: store up to 5GB per month
no: lagre opp til 5GB per måned

source: free account gives 2GB storage total
no: gratis konto gir 2GB lagring totalt

source: Encrypt
no: Krypter

source: Decrypt
no: Dekrypter

source: About
no: Om

source: Encrypt a file or files securely so it's safe to distribute, or decrypt files you have received.
no: Krypter filer sikkert så det er trygt å distribuere dem, eller dekrypter filer du har mottatt.

source: This utility uses AES256-CBC (pyAesCrypt) to encrypt/decrypt files in the AES Crypt file format v.2.
no: Dette programmet bruker AES256-CBC (pyAesCrypt) for å kryptere/dekryptere filer i AES Crypt filformat v.2.

source: Enable compression (smaller file size)
no: Bruk komprimering (mindre filstørrelse)

source: Securely encrypt file(s), so it is safe to distribute over untrusted service (like e-mail).
no: Krypter filer sikkert så det er trygt å sende dem over usikre tjenester (som e-post).

source: If you select more than one file, they will be gathered in an encrypted archive.
no: Hvis du velger flere filer vil de bli samlet i et kryptert filarkiv.

source: If your recipient uses Windows, consider using zip instead of tar.
no: Hvis mottakeren bruker Window bør du vurdere å velge zip arkivering.

source: Select input file(s):
no: Velg fil(er):

source: Specify where to save the output
no: Velg ønsket lagringssted

source: Archiving options (for groups of files)
no: Arkivering (for flere filer)

source: It is recommended to use a full sentence as the passphrase.
no: Det anbefales å bruke en hel setning som passord (passfrase).

source: Passphrase
no: Passfrase

source: Cancel
no: Avbryt

source: Automatically decompress decrypted archives
no: Pakk ut filarkiver automatisk

source: Remove source .aes file after decryption
no: Fjern overflødig .aes fil etter dekryptering

source: Decrypt any encrypted .aes file you have received.
no: Dekrypter enhver kryptert .aes fil du har mottatt.

source: If the decrypted file is a tarball or zip archive, it will be extracted.
no: Hvis den dekrypterte filen er et filarkiv, vil den automatisk pakkes ut.

source: Select input file(s)
no: Velg fil(er)

source: Decryption options
no: Dekryptering

source: Sometimes files are too big for attaching to e-mails.
no: Av og til er filer for store til å sende med e-post.

source: Most of these online file transfer services do not require a login.
no: De fleste av disse forsendelsestjenestene krever ikke brukernavn.

source: Select any provider to visit their website or attempt sending.
no: Klikk på en transportør for å besøke hjemmesiden eller sende fil

source: Choose file transfer service:
no: Velg transportørtjeneste:

source: Open URL
no: Åpne URL

source: Submit issues and new translations at
no: Send inn feilrapporter eller oversettelser her

source: EASE is written by Sigbjørn Smelror (c) 2020, GNU GPL v.3+, to provide
no: EASE er skrevet av Sigbjørn Smelror (c) 2020, GNU GPL v.3+, for å tilby

source: a hopefully user-friendly graphical interface to the pyAesCrypt module.
no: et forhåpentligvis brukervennlig grensesnitt til pyAesCrypt modulen.

source: It is distributed in the hope that it will be useful, but without any warranty.
no: EASE distribueres med det håp at det vil være nyttig, men uten garantier.

source: See the GNU General Public License for more details.
no: Se GNU General Public License for flere detaljer.

source: Usage should be fairly straight-forward: Encrypt -> Send -> Decrypt
no: Programmet er enkelt i bruk: Krypter -> Send til mottaker -> Dekrypter

source: Encrypting
no: Kryptering

source: The sender clicks the Encrypt button, selects the file(s) to encrypt,
no: Avsender klikker på Krypter knappen, velger fil(ene) som skal krypteres,

source: and encrypts them using a passphrase (password) of his or her choosing.
no: og krypterer dem med en selvvalgt passfrase (passord).

source: This produces an encrypted AES Crypt v.2 file that has an .aes suffix.
no: Denne prosessen resulterer i en AES Crypt v.2 fil som slutter med '.aes'.

source: Sending
no: Forsendelse

source: The encrypted .aes file can be distributed over untrusted services like
no: Den krypterte .aes filen kan distribueres over usikre tjenester som for

source: e-mail or any of the file transfer services available when clicking Send.
no: eksempel e-post eller v.h.a en av tjenestene man finner ved å trykke Send.

source: Some services will provide a download link (URL) the recipient can use.
no: Tjenestene tilbyr ofte en nedlastingslenke (URL) mottakeren kan benytte.

source: Remember: never send an encrypted file and its passphrase together!
no: Husk: send aldri passfrasen (passord) sammen med den krypterte filen!

source: Decrypting
no: Dekryptering

source: Having received the encrypted .aes file through e-mail or a service (above),
no: Når du har mottatt en kryptert .aes fil gjennom e-post eller annen tjeneste,

source: the recipient simply clicks the Decrypt button, selects the (.aes) file and
no: kan man simpelthen trykke Dekrypter knappen, velge .aes filen og skrive inn

source: enters the passphrase (password) provided separately by the sender.
no: passfrasen (passordet) som avsenderen har sendt separat.

source: And that's it!
no: Og det er alt som skal til!

source: EASE Crypto relies on pyAesCrypt, password_strength and zxcvbn-python
no: Kryptografien bygger på pyAesCrypt, password_strength og zxcvbn-python.

source: Graphical interface is provided by PySimpleGUIQt, translations use gettext.
no: Grensesnittet er laget med PySimpleGUIQt, mens gettext håndterer oversettelser.

source: EASE is not affiliated with any of the file transfer services mentioned, and
no: EASE har ingen tilknytning til noen av filforsendelsestjenestene, og hvis en

source: please submit an issue if any of the services are terminated or changed.
no: tjeneste er vesentlig endret eller lagt ned, gi beskjed på hjemmesiden.

source: Homepage
no: Hjemmeside

source: Max file size
no: Max filstørrelse

source: Expires (days)
no: Utgår (dager)

source: Require log-in
no: Krever bruker

source: Yes
no: Ja

source: No
no: Nei

source: Limitations
no: Begrensninger

source: Passphrase entropy bits
no: Passfrase entropibits

source: complexity
no: kompleksitet

source: Add another word or two. Uncommon words are better.
no: Legg til enda et par ord. Uvanlige ord er bedre.

source: Use a few words, avoid common phrases.
no: Bruk et par ord, unngå vanlige ordtak.

source: No need for symbols, digits, or uppercase letters.
no: Ikke behov for symboler, tall eller store bokstaver.

source: Straight rows of keys are easy to guess.
no: Tasterekker er alltid lette å gjette.

source: Short keyboard patterns are easy to guess.
no: Korte tastemønstre er enkle å gjette.

source: Use a longer keyboard pattern with more turns.
no: Bruk et lenger tastemønster med flere runder.

source: Repeats like "aaa" are easy to guess.
no: Gjentakelser som "aaa" er lette å gjette.

source: Repeats like "abcabcabc" are only slightly harder to guess than "abc".
no: Gjentagelser som "abcabcabc" er bare bittelitt vanskeligere enn "abc".

source: Avoid repeated words and characters.
no: Unngå gjentatte ord og bokstaver.

source: Sequences like "abc" or "6543" are easy to guess.
no: Sekvenser som "abc" og "6543" er enkle å gjette.

source: Recent years are easy to guess.
no: Forestående år er enkle å gjette seg til.

source: Avoid recent years.
no: Unngå forestående år.

source: Avoid years that are associated with you.
no: Unngå år som kan assosieres med deg.

source: Dates are often easy to guess.
no: Datoer er ofte enkle å gjette.

source: Avoid dates and years that are associated with you.
no: Unngå datoer og år som kan assosieres med deg.

source: This is a top-10 common password.
no: Dette er blant topp 10 passord.

source: This is a top-100 common password.
no: Dette er blant topp 10 passord.

source: This is a very common password.
no: Dette er et svært vanlig passord.

source: This is similar to a commonly used password.
no: Dette minner om et mye brukt passord.

source: A word by itself is easy to guess.
no: Et enkelt ord alene er enkelt å gjette.

source: Names and surnames by themselves are easy to guess.
no: Navn og etternavn alene er enkle å gjette.

source: Common names and surnames are easy to guess.
no: Fornavn og etternavn er enkle å gjette.

source: Capitalization doesn't help very much.
no: Å bruke stor forbokstav hjelper ikke så mye.

source: All-uppercase is almost as easy to guess as all-lowercase.
no: Å bruke bare store bokstaver utgjør liten forskjell.

source: Reversed words aren't much harder to guess.
no: Reverserte ord er ikke vanskelige å gjette.

source: Predictable substitutions like '@' instead of 'a' don't help very much.
no: Forutsigbare utskiftninger som '@' istedet for 'a' hjelper lite.

source: This might take a while.
no: Dette kan ta en stund.

source: Elapsed time
no: Løpetid

source: seconds
no: sekunder

source: Archiving
no: Pakker inn

source: Extracting
no: Pakker ut

source: Error removing file
no: Kunne ikke fjerne fil

source: Error
no: Feil

source: Error: password too short
no: Feil: passordet for kort

source: Error: password too long
no: Feil: passordet for langt

source: Could not archive any files
no: Kunne ikke pakke inn filer

source: Archiving error
no: Arkiveringsfeil

source: Aborting
no: Avbryter

source: Successfully encrypted the input file(s)
no: Fullførte kryptering av valgte fil(er)

source: Success!
no: Suksess!

source: I/O error
no: I/O feil

source: Encryption error
no: Krypteringsfeil

source: Unhandled exception
no: Uhåndtert unntak

source: Selected folder is not a folder
no: Valgte mappe er ikke en mappe

source: Decryption error
no: Dekrypteringsfeil

source: Successfully decrypted input file(s)
no: Fullførte dekryptering av valgte fil(er)

source: Success
no: Suksess

source: Skipped items
no: Hoppet over

source: Partial success
no: Halvveis suksess

source: File not AES v2 format (pyAesCrypt).
no: Fil er ikke AES v2 format (pyAesCrypt).
